Dataset/All/data/k8s-hr-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client-t8-c512-d30-R4000-N2
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://localhost:5000
  8 threads and 512 connections
  Thread calibration: mean lat.: 2.842ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.809ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.815ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.856ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.869ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.826ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.850ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.889ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.78ms    1.21ms   6.88ms   76.99%
    Req/Sec   529.53    238.59     1.20k    69.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.39ms
 75.000%    3.31ms
 90.000%    4.45ms
 99.000%    6.88ms
 99.900%    8.51ms
 99.990%    9.81ms
 99.999%   11.78ms
100.000%   12.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.988     0.000000            1         1.00
       1.611     0.100000         8036         1.11
       1.871     0.200000        16036         1.25
       2.037     0.300000        24036         1.43
       2.195     0.400000        32082         1.67
       2.387     0.500000        40086         2.00
       2.513     0.550000        44051         2.22
       2.665     0.600000        48073         2.50
       2.867     0.650000        52072         2.86
       3.063     0.700000        56074         3.33
       3.305     0.750000        60057         4.00
       3.441     0.775000        62060         4.44
       3.587     0.800000        64060         5.00
       3.761     0.825000        66077         5.71
       3.963     0.850000        68065         6.67
       4.179     0.875000        70067         8.00
       4.315     0.887500        71070         8.89
       4.455     0.900000        72078        10.00
       4.615     0.912500        73076        11.43
       4.799     0.925000        74075        13.33
       5.015     0.937500        75069        16.00
       5.139     0.943750        75572        17.78
       5.271     0.950000        76070        20.00
       5.427     0.956250        76576        22.86
       5.615     0.962500        77079        26.67
       5.811     0.968750        77573        32.00
       5.915     0.971875        77821        35.56
       6.035     0.975000        78074        40.00
       6.179     0.978125        78329        45.71
       6.343     0.981250        78576        53.33
       6.515     0.984375        78823        64.00
       6.603     0.985938        78946        71.11
       6.695     0.987500        79078        80.00
       6.803     0.989062        79198        91.43
       6.923     0.990625        79324       106.67
       7.075     0.992188        79450       128.00
       7.155     0.992969        79509       142.22
       7.251     0.993750        79574       160.00
       7.363     0.994531        79636       182.86
       7.475     0.995313        79696       213.33
       7.615     0.996094        79761       256.00
       7.675     0.996484        79791       284.44
       7.747     0.996875        79822       320.00
       7.843     0.997266        79853       365.71
       7.939     0.997656        79884       426.67
       8.051     0.998047        79915       512.00
       8.111     0.998242        79931       568.89
       8.187     0.998437        79946       640.00
       8.311     0.998633        79962       731.43
       8.439     0.998828        79978       853.33
       8.527     0.999023        79993      1024.00
       8.583     0.999121        80001      1137.78
       8.663     0.999219        80010      1280.00
       8.727     0.999316        80017      1462.86
       8.855     0.999414        80026      1706.67
       8.991     0.999512        80032      2048.00
       9.039     0.999561        80036      2275.56
       9.191     0.999609        80040      2560.00
       9.247     0.999658        80044      2925.71
       9.279     0.999707        80048      3413.33
       9.343     0.999756        80052      4096.00
       9.391     0.999780        80054      4551.11
       9.471     0.999805        80056      5120.00
       9.495     0.999829        80058      5851.43
       9.623     0.999854        80060      6826.67
       9.767     0.999878        80062      8192.00
       9.815     0.999890        80063      9102.22
       9.823     0.999902        80064     10240.00
       9.855     0.999915        80065     11702.86
      10.135     0.999927        80066     13653.33
      10.191     0.999939        80067     16384.00
      10.191     0.999945        80067     18204.44
      10.295     0.999951        80068     20480.00
      10.295     0.999957        80068     23405.71
      11.015     0.999963        80069     27306.67
      11.015     0.999969        80069     32768.00
      11.015     0.999973        80069     36408.89
      11.783     0.999976        80070     40960.00
      11.783     0.999979        80070     46811.43
      11.783     0.999982        80070     54613.33
      11.783     0.999985        80070     65536.00
      11.783     0.999986        80070     72817.78
      12.015     0.999988        80071     81920.00
      12.015     1.000000        80071          inf
#[Mean    =        2.780, StdDeviation   =        1.205]
#[Max     =       12.008, Total count    =        80071]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  120032 requests in 30.00s, 49.69MB read
Requests/sec:   4000.75
Transfer/sec:      1.66MB