Dataset/All/data/k8s-mm-wrk-compose-c6525-25g-exp12-havail0-hori1-verti1-infi1-client-t8-c512-d30-R3000-N4
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=3000
Running 30s test @ http://localhost:8080/wrk2-api/user-timeline/read
  8 threads and 512 connections
  Thread calibration: mean lat.: 4267.110ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 4265.599ms, rate sampling interval: 15351ms
  Thread calibration: mean lat.: 4247.493ms, rate sampling interval: 14385ms
  Thread calibration: mean lat.: 4375.965ms, rate sampling interval: 15564ms
  Thread calibration: mean lat.: 4360.051ms, rate sampling interval: 15540ms
  Thread calibration: mean lat.: 4269.946ms, rate sampling interval: 15630ms
  Thread calibration: mean lat.: 4471.062ms, rate sampling interval: 15777ms
  Thread calibration: mean lat.: 4381.853ms, rate sampling interval: 15728ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    17.18s     5.05s   26.25s    58.22%
    Req/Sec    49.75      0.43    50.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.10s 
 75.000%   21.50s 
 90.000%   24.18s 
 99.000%   26.25s 
 99.900%   27.07s 
 99.990%   27.46s 
 99.999%   28.02s 
100.000%   28.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7122.943     0.000000            1         1.00
   10256.383     0.100000          807         1.11
   11976.703     0.200000         1609         1.25
   13721.599     0.300000         2414         1.43
   15376.383     0.400000         3219         1.67
   17104.895     0.500000         4022         2.00
   18006.015     0.550000         4424         2.22
   18907.135     0.600000         4834         2.50
   19791.871     0.650000         5236         2.86
   20611.071     0.700000         5631         3.33
   21495.807     0.750000         6036         4.00
   21921.791     0.775000         6238         4.44
   22380.543     0.800000         6435         5.00
   22822.911     0.825000         6641         5.71
   23281.663     0.850000         6839         6.67
   23724.031     0.875000         7037         8.00
   23953.407     0.887500         7142         8.89
   24182.783     0.900000         7250        10.00
   24379.391     0.912500         7343        11.43
   24608.767     0.925000         7440        13.33
   24887.295     0.937500         7547        16.00
   24969.215     0.943750         7591        17.78
   25100.287     0.950000         7648        20.00
   25214.975     0.956250         7694        22.86
   25362.431     0.962500         7742        26.67
   25542.655     0.968750         7795        32.00
   25608.191     0.971875         7818        35.56
   25690.111     0.975000         7845        40.00
   25788.415     0.978125         7869        45.71
   25903.103     0.981250         7894        53.33
   26001.407     0.984375         7917        64.00
   26066.943     0.985938         7933        71.11
   26116.095     0.987500         7944        80.00
   26230.783     0.989062         7956        91.43
   26279.935     0.990625         7967       106.67
   26361.855     0.992188         7980       128.00
   26460.159     0.992969         7986       142.22
   26509.311     0.993750         7992       160.00
   26574.847     0.994531         7999       182.86
   26640.383     0.995313         8006       213.33
   26722.303     0.996094         8011       256.00
   26771.455     0.996484         8016       284.44
   26787.839     0.996875         8019       320.00
   26804.223     0.997266         8022       365.71
   26918.911     0.997656         8024       426.67
   26951.679     0.998047         8028       512.00
   26951.679     0.998242         8028       568.89
   27000.831     0.998437         8030       640.00
   27049.983     0.998633         8032       731.43
   27066.367     0.998828         8034       853.33
   27099.135     0.999023         8036      1024.00
   27099.135     0.999121         8036      1137.78
   27099.135     0.999219         8036      1280.00
   27164.671     0.999316         8038      1462.86
   27164.671     0.999414         8038      1706.67
   27181.055     0.999512         8039      2048.00
   27181.055     0.999561         8039      2275.56
   27181.055     0.999609         8039      2560.00
   27213.823     0.999658         8040      2925.71
   27213.823     0.999707         8040      3413.33
   27459.583     0.999756         8041      4096.00
   27459.583     0.999780         8041      4551.11
   27459.583     0.999805         8041      5120.00
   27459.583     0.999829         8041      5851.43
   27459.583     0.999854         8041      6826.67
   28016.639     0.999878         8042      8192.00
   28016.639     1.000000         8042          inf
#[Mean    =    17180.084, StdDeviation   =     5054.967]
#[Max     =    28000.256, Total count    =         8042]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11783 requests in 30.03s, 2.29MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 1378
Requests/sec:    392.31
Transfer/sec:     78.24KB